<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */
    'accepted' => ':يجب قبول الخصائص.',
    'accepted_if' => ':يجب قبول الخصائص عندما: الآخر هو: القيمة.',
    'active_url' => ':فعال الخاصية ليست رابط .',
    'after' => ': يجب أن تكون الخاصية تاريخًا بعد: تاريخ.',
    'after_or_equal' => ':يجب أن تكون الخاصية تاريخًا بعد: تاريخ أو مساويًا لتاريخ .'  ,
    'alpha' => ':يجب أن تحتوي الخاصية على أحرف فقط.',
    'alpha_dash' => ':يجب أن تحتوي الخاصية على أحرف وأرقام وشرطات وشرطات سفلية فقط.',
    'alpha_num' => ':يجب أن تحتوي الخاصية على أحرف وأرقام فقط.',
    'array' => ':يجب أن تكون الخاصية مصفوفة.',
    'ascii' => ':يجب أن تحتوي السمة على أحرف أبجدية رقمية ورموز أحادية البايت فقط.',
    'before' => ':يجب أن يكون الحقل تاريخًا قبل: التاريخ .',
    'before_or_equal' => 'يجب أن يكون الحقل تاريخًا يسبق او مساوي: التاريخ .',
    'between' => [
        'array' => 'يجب أن يحتوي الحقل على ما بين أكثر وأقل عناصر.',
        'file' => 'يجب أن يكون الحقل بين اكثر واقل كيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل بين: أكثر وأقل.',
        'string' => 'يجب أن يكون الحقل بين: أكثر وأقل حروف.',
    ],
    'boolean' => ':يجب أن يكون الحقل صحيحًا أو خطأً.',
    'confirmed' => ': تأكيد الحقل غير مطابق.',
    'current_password' => 'كلمة السر غير صحيحة.',
    'date' => 'الحقل ليس تاريخًا صالحًا.',
    'date_equals' => 'يجب أن يكون الحقل تاريخًا مساويًا لـ: التاريخ.',
    'date_format' => 'السمة لا تطابق مع التنسيق.',
    'decimal' => ':يجب أن يحتوي الحقل على اعداد عشرية.',
    'declined' => ':يجب رفض الحقل .',
    'declined_if' => ':يجب رفض الحقل عندما الآخر هو قيمة.',
    'different' => 'يجب أن يكون الحقل والآخر مختلفين.',
    'digits' => 'يجب أن يكون الحقل أرقامًا.',
    'digits_between' => 'يجب ان يكون الحقل بين أقل وأكقر أعداد.',
    'dimensions' => 'الحقل له أبعاد صورة غير صالحة.',
    'distinct' => 'يحتوي الحقل على قيم مكررة.',
    'doesnt_end_with' => 'لا يجب أن ينتهي الحقل بأي مما يلي: القيم.',
    'doesnt_start_with' => 'لا يجب أن يبدأ الحقل بأي مما يلي القيم.',
    'email' => 'يجب أن يكون الحقل عنوان بريد إلكتروني صالحًا.',
    'ends_with' => 'يجب أن ينتهي الحقل بأحد القيم التالية.',
    'enum' => 'الحقل المحدد غير صالح.',
    'exists' => 'الحقل المحدد غير صالح.',
    'file' => 'يجب أن يكون الحقل ملفًا.',
    'filled' => 'يجب أن يحتوي الحقل على قيمة.',
    'gt' => [
        'array' => ' يجب أن يحتوي الحقل على أكثر من عناصر القيمة.',
        'file' => 'يجب أن يكون الحقل أكبر من القيمة كيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل أكبر من: القيمة.',
        'string' => 'يجب أن يكون الحقل أكبر من أحرف القيمة.',
    ],
    'gte' => [
        'array' => 'يجب أن تحتوي الحقل على عناصر قيمة أو أكثر.',
        'file' => 'يجب أن يكون الحقل أكبر من أو تساوي القيمة كيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل أكبر من أو تساوي القيم.',
        'string' => 'يجب أن يكون الحقل أكبر من أو تساوي أحرف القيمة.',
    ],
    'image' => 'يجب أن يكون الحقل صورة.',
    'in' => 'الحقل المحددغير صالح.',
    'in_array' => 'حقل : غير موجود في أخرى.',
    'integer' => 'يجب أن يكون الحقل عددًا صحيحًا.',
    'ip' => 'صحيحا IP يجب ان يكون الحقل غنوان .',
    'ipv4' => ' IPv4 يجب ان يكون الحقل غنوان .',
    'ipv6' => ' IPv6 يجب ان يكون الحقل غنوان .',
    'json' => ' json يجب ان يكون الحقل .',
    'lowercase' => 'يجب أن يكون الحقل صغيرة.',
    'lt' => [
        'array' => 'يجب أن يحتوي الحقل على أقل من عناصر القيمة.',
        'file' => 'أن تكون السمة أقل من قيمة كيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل أقل من القيمة.',
        'string' => 'يجب أن يكون الحقل أقل من أحرف القيمة.',
    ],
    'lte' => [
        'array' => ' ألا يحتوي الحقل على أكثر من عناصر القيمة.',
        'file' => 'يجب أن تكون السمة أقل من أو تساوي قيمة بالكيلوبايت.',
        'numeric' =>'يجب أن يكون الحقل أقل من أو تساوي القيمة.',
        'string' => 'يجب أن يكون الحقل أقل من أو تساوي أحرف القيمة.',
    ],
    'mac_address' => ' صالح MAC يجب أن تكون السمة عنوان .',
    'max' => [
        'array' => 'يجب ألا يحتوي الحقل على أكثر من اكثر العناصر.',
        'file' => 'يجب ألا يكون الحقل أكبر من كحد أقصى كيلوبايت.',
        'numeric' => 'يجب ألا يكون الحقل أكبر من الحد الاقصى.',
        'string' => 'The :يجب ألا يكون الحقل أكبر من الحد الأقصى من الأحرف.',
    ],
    'max_digits' => 'يجب ألا يحتوي الحقل: على أكثر من الحد الأقصى من الأرقام.',
    'mimes' => 'يجب أن يكون الحقل ملفًا من النوع القيم.',
    'mimetypes' => 'يجب أن يكون الحقل ملفًا من النوع القيم.',
    'min' => [
        'array' => 'يجب أن يحتوي الحقل على ما لا يقل عن الحد الأدنى من العناصر.',
        'file' => 'يجب أن يكون الحقل على الأقل كحد أدنى كيلوبايت.',
        'numeric' => 'يجب أن تكون السمة حد الأدنى.',
        'string' => 'يجب ألا تقل السمة عن حرف كحد الأدنى.',
    ],
    'min_digits' => 'يجب أن يحتوي الحقل على الأقل على: الحد الأدنى من الأرقام.',
    'multiple_of' => 'يجب أن يكون الحقل من مضاعفات القيمة.',
    'not_in' => 'الحقل المحدد غير صالح.',
    'not_regex' => 'تنسيق الحقل: غير صالح.',
    'numeric' => 'يجب أن يكون الحقل رقمًا.',
    'password' => [
        'letters' => 'يجب أن يحتوي الحقل على حرف واحد على الأقل.',
        'mixed' => 'يجب أن يحتوي الحقل: على حرف كبير واحد وحرف صغير واحد على الأقل.',
        'numbers' => 'يجب أن يحتوي الحقل على رقم واحد على الأقل.',
        'symbols' => 'يجب أن يحتوي الحقل على رمز واحد على الأقل.',
        'uncompromised' => 'ظهرت السمة المعطاة في تسرب بيانات الرجاء اختيار سمة مختلف.',
    ],
    'present' => 'يجب أن يكون الحقل  موجودًا.',
    'prohibited' => 'حقل : محظور.',
    'prohibited_if' => 'يُحظر الحقل : عندما: الآخر هو: القيمة.',
    'prohibited_unless' =>' يُحظر الحقل: إلا إذا كان الآخر في القيم.',
    'prohibits' => 'يمنع حقل السمة الآخرين من التواجد',
    'regex' => 'تنسيق الحقل: غير صالح.',
    'required' => 'حقل  مطلوب اجباري.',
    'required_array_keys' => 'يجب أن يحتوي الحقل على إدخالات لـ: قيمs.',
    'required_if' => 'يكون الحقل  مطلوبًا اجباريا عندما: الآخر هو: القيمة.',
    'required_if_accepted' => 'يكون الحقل مطلوبًا اجباريا عند: قبول الآخر.',
    'required_unless' => 'حقل مطلوب اجباري إلا إذا كان الآخر في: قيم.',
    'required_with' => 'يكون الحقل مطلوبًا اجباري عندما تكون: القيم موجودة.',
    'required_with_all' => 'يكون الحقل مطلوبًا اجباري عندما تكون: القيم موجودة.',
    'required_without' => 'يكون الحقل مطلوبًا اجباري عندما تكون: القيم غير موجودة.',
    'required_without_all' => 'يكون الحقل  مطلوبًا في حالة عدم وجود أي من قيم:.',
    'same' => 'يجب أن يتطابق الحقل و الآخر.',
    'size' => [
        'array' => 'يجب أن يحتوي الحقل على: حجم العناصر.',
        'file' => 'يجب أن يكون الحقل: الحجم كيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل: الحجم.',
        'string' => ' يجب أن يكون الحقل: حجم الأحرف.',
    ],
    'starts_with' => 'يجب أن يبدأ الحقل: بأحد القيم التالية:.',
    'string' => 'يجب أن يكون الحقل: سلسلة.',
    'timezone' => 'يجب أن يكون الحقل منطقة زمنية صالحة.',
    'unique' => 'تم استخدام الحقل بالفعل.',
    'uploaded' => 'تم رفع الحقل.',
    'uppercase' => 'يجب أن تكون الحقول كبيرة.',
    'url' => 'صالحًا URL يجب أن يكون الحقل عنوان .',
    'ulid' => 'صالحًا ULID يجب أن يكون الحقل.',
    'uuid' => 'صالحًا ULID يجب أن يكون الحقل.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention 'attribute.rule' to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'اسم القاعدة' => 'رسالة مخصصة'  ,
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as 'E-Mail Address' instead
    | of 'email'. This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
